---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTable.GetEnumerator
source: html/839b25c2-d7a9-5fd4-9648-1c6c8efbaff7.htm
---
# Autodesk.Revit.DB.ExportPatternTable.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.